[
  {
    "coderhouse": {
      "webDevelopment": {
        "name": "Desarrollo Web",
        "date": "Del 17/10/22 al 19/12/22",
        "certificate": "https://pub.coderhouse.com/legacy-certificates/63bdd24981bd15000eea9200?lang=es",
        "description": "Durante este curso aprendí los fundamentos del desarrollo web, incluyendo la estructura con HTML y el diseño con CSS. Profundicé en conceptos como box model, Flexbox y Grid para maquetación responsiva. Implementé animaciones, transiciones y transformaciones, y utilicé herramientas modernas como Bootstrap, SASS y pseudoclases. Además, trabajé con control de versiones usando Git y GitHub, enfoques de diseño adaptativo con media queries y técnicas básicas de SEO. Finalizamos aprendiendo sobre despliegue en servidores y la relación con el cliente final."
    },
    "javascript": {
      "name": "Javascript",
      "date": "Del 23/01/23 al 27/03/23",
      "certificate": "https://pub.coderhouse.com/legacy-certificates/642c5b572fc3c7001a698a16?lang=es",
      "description": "Este curso me permitió dominar las bases de JavaScript, desde la sintaxis, variables y estructuras de control hasta el uso avanzado de funciones, objetos y arrays. Aprendí a manipular el DOM, gestionar eventos y trabajar con almacenamiento local usando JSON. Además, incorporé el uso de funciones de orden superior, asincronía con promesas, peticiones HTTP con Fetch y conocimientos sobre frameworks y Node.js. Se incluyeron ejercicios prácticos y workshops que consolidaron mi aprendizaje de forma aplicada."
    },
    "react": {
      "name": "React Js",
      "date": "Del 10/04/23 al 31/05/23",
      "certificate": "https://pub.coderhouse.com/legacy-certificates/649a8afd5ae64100026bf40d?lang=es",
      "description": "En este curso profundicé en el desarrollo de interfaces con React, comenzando por la instalación del entorno y la sintaxis JSX. Aprendí a construir componentes reutilizables, trabajar con estados y props, y a gestionar flujos asincrónicos con Promises y métodos como map(). Me enfoqué en el consumo de APIs, navegación con React Router y el manejo de eventos. También exploré patrones de diseño con Hooks y Context para el manejo global del estado. Finalmente, implementé proyectos prácticos con Firebase como backend y técnicas modernas de renderizado, consolidando mis conocimientos en un workshop final."
    }
  }
},
{
  "selfTaught": {
    "sergieCode": {},
    "midudev": {}
  }
}
]